Tekla.Structures.Dialog.TeklaProgressBar
The TeklaProgressBar class represents the common progress bar control for the Open API.

Tekla.Structures.Dialog.TeklaProgressBar.#ctor(System.String)
Initializes the common progress bar control.
text: The message to display in the control.

Tekla.Structures.Dialog.TeklaProgressBar.CancelClicked
The CancelClicked event is raised when the cancel button is clicked.

Tekla.Structures.Dialog.TeklaProgressBar.TeklaProgressBar_Load(System.Object,System.EventArgs)
Used to translate progress bar and to set Tekla Standard properties.

Tekla.Structures.Dialog.TeklaProgressBar.Value
Gets or sets the current position of the progress bar.
Remarks: The value should be a number between 0 and 100.

Tekla.Structures.Dialog.TeklaProgressBar.Text
Gets or sets the current message text of the progress bar.

Tekla.Structures.Dialog.TeklaProgressBar.components
Required designer variable.

Tekla.Structures.Dialog.TeklaProgressBar.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.TeklaProgressBar.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.